
#*** 3 ***
from art import *
import this
#a. Выводит в строку "Дзэн Питона", основная философия языка программирования

import antigravity
#b. ткрывает в браузере комикс про Phyton

import __hello__
#c. print("Hello world!")

# from __future__ import braces
#d Пасхальное яйцо в языке программирования. Шутка о том, что в Python никогда не будут использованы фигурные скобки вместо пробелов.

#*** 4 ***
print("""
            *          *              * * * * * * *  *             *                               
           * *         *              *                *         *                     
          *   *        *              *                  *     *                            
         *     *       *              *                    * *                             
        * * * * *      *              * * * * * * *         *                                          
       *         *     *              *                    * *                              
      *           *    *              *                  *     *                           
     *             *   *              *                *         *                        
    *               *  * * * * * * *  * * * * * * *  *             * 
""")

#*** 4.* ***
tprint("Alex")

#*** 5 ***
x=int(input("Введите X:"))
y=int(input("Введите Y:"))

print("X =",x, ', ', "Y =",y)
print("Сумма:", x+y)
print("Целочисленное деление:", x//y)
print("Остаток от деления:", x%y)
print("X в степени Y:", x**y)

